#  The Second Normal Form (2NF)

##  Learning Objectives
By the end of this lesson, you should be able to:
- Understand the requirements for a table to meet **Second Normal Form (2NF)** in database design.  
- Identify and eliminate **partial dependencies** by creating separate tables for non-key attributes.  
- Apply the normalization process to reduce redundancy and improve data integrity.

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:Mysql%40505@localhost:3306/company_data

##  Step 1 — View the Original Table

Let’s begin by viewing the `Company_employees` table in the `company_data` database.

In [3]:
%%sql

SELECT
    *
FROM
    Company_employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
5 rows affected.

[('E001', 'Carmel', 'J01', 'Chef', 26, 'Cape Town'),
 ('E001', 'Carmel', 'J02', 'Waiter', 26, 'Cape Town'),
 ('E002', 'Stefanie', 'J02', 'Waiter', 56, 'Joburg'),
 ('E002', 'Stefanie', 'J03', 'Bartender', 56, 'Joburg'),
 ('E003', 'Lisa', 'J01', 'Chef', 5, 'Nairobi')]

##  Step 2 — Understanding Second Normal Form (2NF)

For a table to be in **2NF**, it must meet two conditions:
1. It must already satisfy **1NF** (all attributes are atomic, with a primary key).  
2. It must have **no partial dependency** — meaning all non-key attributes must depend on the **entire primary key**, not just part of it.

In our current table:
| Employee_id | Name | Job_code | Job_title | State_code | Home_state |
|--------------|------|-----------|-------------|-------------|-------------|

- `Employee_id` identifies employee-related data like `Name`, `State_code`, and `Home_state`.  
- `Job_code` identifies job-related data like `Job_title`.  
- We have **repetition** (partial dependency) because employee and job details are repeated for each combination.

To eliminate this, we’ll separate the data into **three related tables**:
1. `Employees` → Employee details  
2. `Jobs` → Job details  
3. `Employee_roles` → Mapping between employees and jobs

##  Step 3 — Create the `Employees` Table

We’ll extract all employee-related information from `Company_employees` into a new table called `Employees`.

Each row is uniquely identified by `Employee_id`, which will serve as the **Primary Key**.

In [4]:
%%sql

CREATE TABLE Employees AS
SELECT DISTINCT
    Employee_id,
    Name,
    State_code,
    Home_state
FROM
    Company_employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[]

In [5]:
%%sql

ALTER TABLE Employees
ADD PRIMARY KEY (Employee_id);

 * mysql+pymysql://root:***@localhost:3306/company_data
0 rows affected.

[]

##  Step 4 — Create the `Jobs` Table

Now we’ll create a table for job-related information, containing each job’s unique code and title.  

`Job_code` serves as the **Primary Key** since each job title is uniquely identified by it.

In [6]:
%%sql

CREATE TABLE Jobs AS
SELECT DISTINCT
    Job_code,
    Job_title
FROM
    Company_employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[]

In [7]:
%%sql

ALTER TABLE Jobs
ADD PRIMARY KEY (Job_code);

 * mysql+pymysql://root:***@localhost:3306/company_data
0 rows affected.

[]

##  Step 5 — Create the `Employee_roles` Table

Finally, we need a **relationship (mapping) table** that links employees to their jobs.  
Each row represents an employee-job assignment.

We’ll define a **composite primary key** using both `Employee_id` and `Job_code` to ensure that each combination is unique.

In [8]:
%%sql

CREATE TABLE Employee_roles AS
SELECT DISTINCT
    Employee_id,
    Job_code
FROM
    Company_employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
5 rows affected.

[]

In [9]:
%%sql

ALTER TABLE Employee_roles
ADD PRIMARY KEY (Employee_id, Job_code);

 * mysql+pymysql://root:***@localhost:3306/company_data
0 rows affected.

[]

##  Step 6 — Verify the New Tables

We’ll now inspect the three tables created to ensure they contain the expected data and structure.

In [10]:
%%sql

SELECT * FROM Employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[('E001', 'Carmel', 26, 'Cape Town'),
 ('E002', 'Stefanie', 56, 'Joburg'),
 ('E003', 'Lisa', 5, 'Nairobi')]

In [11]:
%%sql

SELECT * FROM Jobs;

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[('J01', 'Chef'), ('J02', 'Waiter'), ('J03', 'Bartender')]

In [12]:
%%sql

SELECT * FROM Employee_roles;

 * mysql+pymysql://root:***@localhost:3306/company_data
5 rows affected.

[('E001', 'J01'),
 ('E001', 'J02'),
 ('E002', 'J02'),
 ('E002', 'J03'),
 ('E003', 'J01')]

##  Summary

In this notebook, we transformed the `Company_employees` table into **Second Normal Form (2NF)** by:

- Splitting the table into three smaller, logically independent tables:
  - **Employees** — stores employee information.
  - **Jobs** — stores job details.
  - **Employee_roles** — maps employees to their jobs.
- Eliminating **partial dependencies**, ensuring that each non-key attribute depends entirely on its respective primary key.
- Improving **data integrity**, **reducing redundancy**, and setting the stage for **Third Normal Form (3NF)** normalization.

This structure now makes updates, deletions, and inserts more efficient and consistent across the database.